lab11/powerblade/software/nrf51822/apps/powerblade/main.c
    // begin sending data
    uart_tx_enable();
    uart_tx_handler();

    // transmission sent for this cycle
    already_transmitted = true;
}

void uart_start_receive (void) {
    if (!skip_uart_cycle) {
        // we are ready to receive, go for it
        uart_rx_enable();
    } else {
        // skip this reception cycle to conserve power while doing heavy
        //  lifting in BLE-land
        app_timer_start(enable_uart_timer, UART_SKIP_DURATION, NULL);
        // only skip a single cycle
        skip_uart_cycle = false;
        // if we haven't already transmitted, don't start now
        //  if we have, we won't move on to the next state for a cycle since
        //  already_transmitted will stay true
        already_transmitted = true;
    }
}


/**************************************************
 * Services
 **************************************************/

void services_init (void) {

    // Add configuration service
    simple_ble_add_service(&config_service);

        // Add characteristic to display status codes
        simple_ble_add_characteristic(1, 0, 1, 0, // read, write, notify, vlen
                sizeof(status_code), (uint8_t*)&status_code,
                &config_service, &config_status_char);

        // Add characteristic to access voff
        simple_ble_add_characteristic(1, 1, 0, 0, // read, write, notify, vlen
                sizeof(powerblade_config.voff), (uint8_t*)&powerblade_config.voff,
                &config_service, &config_voff_char);

        // Add characteristic to access ioff
        simple_ble_add_characteristic(1, 1, 0, 0, // read, write, notify, vlen
                sizeof(powerblade_config.ioff), (uint8_t*)&powerblade_config.ioff,
                &config_service, &config_ioff_char);

        // Add characteristic to access curoff
        simple_ble_add_characteristic(1, 1, 0, 0, // read, write, notify, vlen
                sizeof(powerblade_config.curoff), (uint8_t*)&powerblade_config.curoff,
                &config_service, &config_curoff_char);

        // Add characteristic to access pscale
        simple_ble_add_characteristic(1, 1, 0, 0, // read, write, notify, vlen
                sizeof(powerblade_config.pscale), (uint8_t*)&powerblade_config.pscale,
                &config_service, &config_pscale_char);

        // Add characteristic to access vscale
        simple_ble_add_characteristic(1, 1, 0, 0, // read, write, notify, vlen
                sizeof(powerblade_config.vscale), (uint8_t*)&powerblade_config.vscale,
                &config_service, &config_vscale_char);

        // Add characteristic to access whscale
        simple_ble_add_characteristic(1, 1, 0, 0, // read, write, notify, vlen
                sizeof(powerblade_config.whscale), (uint8_t*)&powerblade_config.whscale,
                &config_service, &config_whscale_char);

    // Add raw sample download service
    simple_ble_add_service(&rawSample_service);

        // Add the characteristic to signal grab sample data
        begin_rawSample = false;
        simple_ble_add_characteristic(1, 1, 0, 0, // read, write, notify, vlen
                1, (uint8_t*)&begin_rawSample,
                &rawSample_service, &rawSample_char_begin);

        // Add the characteristic to provide raw samples
        //  This characteristic requires read authorizations. This gives us the
        //  opportunity to disable the UART transmissions while before a read
        //  of it starts
        memset(raw_sample_data, 0x00, SAMDATA_MAX_LEN);
        simple_ble_add_auth_characteristic(1, 0, 0, 1, // read, write, notify, vlen
                true, false, // read auth, write auth
                SAMDATA_MAX_LEN, (uint8_t*)raw_sample_data,
                &rawSample_service, &rawSample_char_data);
        // must initialize to maximum valid length. Now reset down to 1
        simple_ble_update_char_len(&rawSample_char_data, 1);

        // Add the characteristic to provide raw samples
        rawSample_status = 2;
        simple_ble_add_characteristic(1, 1, 1, 0, // read, write, notify, vlen
                1, (uint8_t*)&rawSample_status,
                &rawSample_service, &rawSample_char_status);
}

void ble_evt_connected (ble_evt_t* p_ble_evt) {
    // a connection just started, skip the next uart cycle to save power
    skip_uart_cycle = true;

    // stop any running advertisements and don't restart for a single UART cycle
    advertising_stop();
    app_timer_stop(start_eddystone_timer);
    app_timer_stop(start_manufdata_timer);
    app_timer_start(restart_advs_timer, CONNECTION_SKIP_DURATION, NULL);
}

void ble_evt_write (ble_evt_t* p_ble_evt) {

    if (simple_ble_is_char_event(p_ble_evt, &rawSample_char_begin)) {
        // start or stop collection and transfer of raw samples as appropriate
        if (rawSample_state == RS_NONE && begin_rawSample) {
            // start raw sample collection
            rawSample_state = RS_START;
            rawSample_status = 0;
        } else if (rawSample_state != RS_NONE && !begin_rawSample) {
            rawSample_state = RS_QUIT;
            rawSample_status = 255;
        }

    } else if (simple_ble_is_char_event(p_ble_evt, &rawSample_char_status)) {
        // clear value on write
        rawSample_status = 0;

        // request next data from MSP430
        if (rawSample_state == RS_IDLE) {
            rawSample_state = RS_NEXT;
        }

    } else if (simple_ble_is_char_event(p_ble_evt, &config_voff_char) ||
               simple_ble_is_char_event(p_ble_evt, &config_ioff_char) ||
               simple_ble_is_char_event(p_ble_evt, &config_curoff_char) ||
               simple_ble_is_char_event(p_ble_evt, &config_pscale_char) ||
               simple_ble_is_char_event(p_ble_evt, &config_vscale_char) ||
               simple_ble_is_char_event(p_ble_evt, &config_whscale_char)) {
        // send updated value to MSP
        config_state = CONF_SET_VALUES;
    }
}

void ble_evt_rw_auth (ble_evt_t* p_ble_evt) {
    if (simple_ble_is_read_auth_event(p_ble_evt, &rawSample_char_data)) {
        // read request for data characteristic, disable uart for a cycle and
        //  authorize the read
        skip_uart_cycle = true;
        uint32_t err_code = simple_ble_grant_auth(p_ble_evt);
        APP_ERROR_CHECK(err_code);
    }
}


