lab11/powerblade/software/nrf51822/apps/powerblade/main.c
/**************************************************
 * Initialization
 **************************************************/

void timers_init (void) {
    uint32_t err_code;

    err_code = app_timer_create(&enable_uart_timer, APP_TIMER_MODE_SINGLE_SHOT, (app_timer_timeout_handler_t)uart_start_receive);
    APP_ERROR_CHECK(err_code);

    err_code = app_timer_create(&start_eddystone_timer, APP_TIMER_MODE_SINGLE_SHOT, (app_timer_timeout_handler_t)start_eddystone_adv);
    APP_ERROR_CHECK(err_code);

    err_code = app_timer_create(&start_manufdata_timer, APP_TIMER_MODE_SINGLE_SHOT, (app_timer_timeout_handler_t)start_manufdata_adv);
    APP_ERROR_CHECK(err_code);

    err_code = app_timer_create(&restart_advs_timer, APP_TIMER_MODE_SINGLE_SHOT, (app_timer_timeout_handler_t)restart_advertisements);
    APP_ERROR_CHECK(err_code);
}

void ble_error(uint32_t error_code) {
    // display error when developing on the squall platform
    //  Has no effect on production PowerBlades
    led_init(ERROR_LED);
    led_on(ERROR_LED);
}

int main(void) {
    // Initialization
    simple_ble_app = simple_ble_init(&ble_config);
    timers_init();
    conn_params_init();
    uart_init();
    init_adv_data();

    // Initialization complete
    start_manufdata_adv();
    uart_rx_enable();

    while (1) {
        power_manage();

        // state machine. Only send one message per second
        if (!already_transmitted) {
            transmit_message();
        }
    }
}

void transmit_message(void) {
    // select message to transmit at this interval
    //  message priority is based on ordering in this function

    if (startup_state == STARTUP_NOP) {
        // skip this first cycle
        already_transmitted = true;
        startup_state = STARTUP_SET_SEQ;

    } else if (nak_state == NAK_CHECKSUM) {
        // send NAK to MSP
        uint16_t length = 2+1+1; // length (x2), type, checksum
        tx_buffer[0] = (length >> 8);
        tx_buffer[1] = (length & 0xFF);
        tx_buffer[2] = (UART_NAK);
        tx_buffer[3] = additive_checksum(tx_buffer, length-1);
        uart_send(tx_buffer, length);
        nak_state = NAK_NONE;

    } else if (nak_state == NAK_RESEND) {
        // resend most recent message to MSP
        uart_send(tx_data, tx_data_len);
        nak_state = NAK_NONE;

    } else if (rawSample_state == RS_START) {
        // send start message to MSP
        uint16_t length = 2+1+1; // length (x2), type, checksum
        tx_buffer[0] = (length >> 8);
        tx_buffer[1] = (length & 0xFF);
        tx_buffer[2] = (START_SAMDATA);
        tx_buffer[3] = additive_checksum(tx_buffer, length-1);
        uart_send(tx_buffer, length);
        rawSample_state = RS_WAIT_START;

    } else if (rawSample_state == RS_NEXT) {
        // send next data message to MSP
        uint16_t length = 2+1+1; // length (x2), type, checksum
        tx_buffer[0] = (length >> 8);
        tx_buffer[1] = (length & 0xFF);
        tx_buffer[2] = (CONT_SAMDATA);
        tx_buffer[3] = additive_checksum(tx_buffer, length-1);
        uart_send(tx_buffer, length);
        rawSample_state = RS_WAIT_DATA;

    } else if (rawSample_state == RS_QUIT) {
        // send quit message to MSP
        uint16_t length = 2+1+1; // length (x2), type, checksum
        tx_buffer[0] = (length >> 8);
        tx_buffer[1] = (length & 0xFF);
        tx_buffer[2] = (DONE_SAMDATA);
        tx_buffer[3] = additive_checksum(tx_buffer, length-1);
        uart_send(tx_buffer, length);
        rawSample_state = RS_WAIT_QUIT;

    } else if (config_state == CONF_SET_VALUES) {
        // set configuration values
        uint16_t length = 2+1+sizeof(powerblade_config)+1; // length(x2), type, configuration struct, checksum
        tx_buffer[0] = (length >> 8);
        tx_buffer[1] = (length & 0xFF);
        tx_buffer[2] = (SET_CONF);
        memcpy(&(tx_buffer[3]), (uint8_t*)(&powerblade_config), sizeof(powerblade_config));
        tx_buffer[3+sizeof(powerblade_config)] = additive_checksum(tx_buffer, length-1);
        uart_send(tx_buffer, length);
        config_state = CONF_NONE;

    } else if (startup_state == STARTUP_SET_SEQ) {
        // update sequence number on startup for debugging
        // set sequence number. Used as a test message
        uint16_t length = 2+1+1+1; // length (x2), type, value, checksum
        tx_buffer[0] = (length >> 8);
        tx_buffer[1] = (length & 0xFF);
        tx_buffer[2] = (SET_SEQ);
        tx_buffer[3] = 150; // randomly selected sequence number
        tx_buffer[4] = additive_checksum(tx_buffer, length-1);
        uart_send(tx_buffer, length);
        startup_state = STARTUP_GET_CONF;

    } else if (startup_state == STARTUP_GET_CONF) {
        // get MSP configuration to display to user
        uint16_t length = 2+1+1; // length(x2), type, checksum
        tx_buffer[0] = (length >> 8);
        tx_buffer[1] = (length & 0xFF);
        tx_buffer[2] = (GET_CONF);
        tx_buffer[3] = additive_checksum(tx_buffer, length-1);
        uart_send(tx_buffer, length);
        startup_state = STARTUP_NONE;
    }
}

void on_receive_message(uint8_t* buf, uint16_t len) {
    if (len > 0) {
        // switch on add data type
        uint8_t data_type = buf[0];
        switch (data_type) {
            case UART_NAK:
                nak_state = NAK_RESEND;
                break;
            case START_SAMDATA:
                // MSP acknowledges, wait for data
                if (rawSample_state != RS_QUIT) {
                    rawSample_state = RS_WAIT_DATA;
                }
                break;
            case CONT_SAMDATA:
                // update data
                memcpy(raw_sample_data, &(buf[1]), len-1);
                simple_ble_update_char_len(&rawSample_char_data, len-1);

                // notify user of new data
                rawSample_status = 1;
                simple_ble_notify_char(&rawSample_char_status);
                if (rawSample_state != RS_QUIT) {
                    rawSample_state = RS_IDLE;
                }
                break;
            case DONE_SAMDATA:
                // notify user samples are done
                begin_rawSample = false;
                rawSample_status = 2;
                simple_ble_notify_char(&rawSample_char_status);

                // reset data
                memset(raw_sample_data, 0x00, SAMDATA_MAX_LEN);
                simple_ble_update_char_len(&rawSample_char_data, 1);

                rawSample_state = RS_NONE;
                break;
            case GET_CONF:
                // updated configuration from the MSP
                if ((len-1) == sizeof(powerblade_config)) {
                    memcpy((uint8_t*)&powerblade_config, &(buf[1]), len-1);
                } else {
                    // data was the wrong size. Report error
                    status_code = STATUS_BAD_CONFIG_SIZE;
                    simple_ble_notify_char(&config_status_char);
                }

            default:
                // unhandled uart type. Don't handle it
                break;
        }
    } else {
        // expected a message but didn't receive one. Signal error status over
        //  status characteristic
        if (rawSample_state == RS_WAIT_START) {
            status_code = STATUS_NO_RS_START;
            simple_ble_notify_char(&config_status_char);
        } else if (rawSample_state == RS_WAIT_DATA) {
            status_code = STATUS_NO_RS_DATA;
            simple_ble_notify_char(&config_status_char);
        } else if (rawSample_state == RS_WAIT_QUIT) {
            status_code = STATUS_NO_RS_QUIT;
            simple_ble_notify_char(&config_status_char);
        }
    }
}

